Repository: aybekjumashev/test_bot_for_students
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Uzbek
ru: Узбекский

source: Karakalpak
ru: Каракалпакский

source: Russian
ru: Русский

source: Shaxsiy maʻlumotlar
ru: Личные данные

source: Taʻlim maʻlumotlari
ru: Данные об образовании

source: Vaqt belgilari
ru: Временные отметки

source: Nomi
ru: Название

source: Fayl yo'q
ru: Файл отсутствует

source: Mavjud Tillar
ru: Доступные языки

source: Turli tillardagi fayllarda savollar soni mos kelmadi: {}
ru: Количество вопросов в файлах на разных языках не совпало: {}

source: Savollarni ommaviy yuklash xatosi
ru: Ошибка массовой загрузки вопросов

source: Yuklash uchun savollar topilmadi (fayllar bo'sh yoki ajratilmadi).
ru: Вопросы для загрузки не найдены (файлы пусты или не разделены).

source: {}-savol uchun javob topilmadi.
ru: Ответ для {}-го вопроса не найден.

source: Savollarni Ommaviy Yuklash
ru: Массовая загрузка вопросов

source: Test Savoli
ru: Вопрос теста

source: Test Savollari
ru: Вопросы теста

source: Aralash Test
ru: Смешанный тест

source: Test Tavsifi
ru: Описание теста

source: va yana
ru: и еще

source: ta savol...
ru: вопросов...

source: Tanlangan testlarni Excelga eksport qilish
ru: Экспортировать выбранные тесты в Excel

source: Eksport uchun testlar tanlanmadi.
ru: Тесты для экспорта не выбраны.

source: Test ID
ru: ID Теста

source: Telegram ID
ru: ID Telegram

source: Telefon
ru: Телефон

source: Bilimlendiriw Túri
ru: Тип образования

source: Mákeme
ru: Учреждение

source: Basqısh (JOO)
ru: Ступень (ВУЗ)

source: Fakultet (JOO)
ru: Факультет (ВУЗ)

source: Kurs
ru: Курс

source: Test Baslanıw Waqıtı
ru: Время начала теста

source: Test Tamamlanıw Waqıtı
ru: Время окончания теста

source: Nátiyje (Ball)
ru: Результат (Балл)

source: Jámi Sorawlar
ru: Всего вопросов

source: Sarplaǵan Waqıtı (s)
ru: Затраченное время (с)

source: Sertifikat Kodı
ru: Код сертификата

source: Sertifikat Jiberildi
ru: Сертификат отправлен

source: Awa
ru: Да

source: Yaq
ru: Нет

source: Eksport uchun ma'lumot topilmadi.
ru: Данные для экспорта не найдены.

source: Test_Natijalari
ru: Результаты_Теста

source: Ismingiz
ru: Ваше имя

source: Familiyangiz
ru: Ваша фамилия

source: Otangizning ismi
ru: Имя вашего отца

source: Masalan: 1
ru: Например: 1

source: Ta'lim muassasasi turi
ru: Тип учебного заведения

source: Muassasa nomi
ru: Название учебного заведения

source: Ta'lim bosqichi (OTM uchun)
ru: Ступень обучения (для ВУЗа)

source: Fakultet (OTM uchun)
ru: Факультет (для ВУЗа)

source: Kurs (bosqich)
ru: Курс (ступень)

source: Nechanchi kursda (yoki litsey/kollejda nechanchi bosqichda) o'qishingizni kiriting.
ru: Введите, на каком курсе (или на какой ступени в лицее/колледже) вы учитесь.

source: Tanlang...
ru: Выберите...

source: Avval ta'lim turini tanlang
ru: Сначала выберите тип образования

source: OTM tanlanganda ochiladi
ru: Откроется при выборе ВУЗа

source: OTM uchun ta'lim bosqichini tanlang.
ru: Выберите ступень обучения для ВУЗа.

source: OTM uchun fakultetni tanlang.
ru: Выберите факультет для ВУЗа.

source: Fan
ru: Предмет

source: Fanni tanlang
ru: Выберите предмет

source: Savollar fayli (O'zbekcha, DOCX)
ru: Файл с вопросами (Узбекский, DOCX)

source: Savollar fayli (Qoraqalpoqcha, DOCX)
ru: Файл с вопросами (Каракалпакский, DOCX)

source: Savollar fayli (Ruscha, DOCX)
ru: Файл с вопросами (Русский, DOCX)

source: Javoblar ketma-ketligi
ru: Последовательность ответов

source: Masalan: ABADDCB... Har bir fayldagi savollar soniga mos kelishi kerak.
ru: Например: ABADDCB... Должно соответствовать количеству вопросов в каждом файле.

source: Savol ajratuvchi belgi
ru: Разделитель вопросов

source: DOCX faylida savollarni ajratib turuvchi belgi.
ru: Символ, разделяющий вопросы в файле DOCX.

source: Javoblar faqat A, B, C, D harflaridan iborat bo'lishi kerak.
ru: Ответы должны состоять только из букв A, B, C, D.

source: Hech bo'lmaganda bitta tilda savollar faylini yuklang.
ru: Загрузите файл с вопросами хотя бы на одном языке.

source: Javoblar ketma-ketligini kiriting.
ru: Введите последовательность ответов.

source: Nomi (O'zbekcha)
ru: Название (Узбекский)

source: Nomi (Qoraqalpoqcha)
ru: Название (Каракалпакский)

source: Nomi (Ruscha)
ru: Название (Русский)

source: Bu OTMmi?
ru: Это ВУЗ?

source: Ta'lim muassasasi turlari
ru: Типы учебных заведений

source: Ta'lim turi
ru: Тип образования

source: Ta'lim muassasasi
ru: Учебное заведение

source: Ta'lim muassasalari
ru: Учебные заведения

source: Ta'lim bosqichi (OTM)
ru: Ступень обучения (ВУЗ)

source: Ta'lim bosqichlari (OTM)
ru: Ступени обучения (ВУЗ)

source: Fakultet
ru: Факультет

source: Fakultetlar
ru: Факультеты

source: The Telegram ID must be set
ru: Telegram ID должен быть установлен

source: Superuser must have is_staff=True.
ru: Суперпользователь должен иметь is_staff=True.

source: Superuser must have is_superuser=True.
ru: Суперпользователь должен иметь is_superuser=True.

source: Superusers must have a password.
ru: У суперпользователей должен быть пароль.

source: Telegram Username
ru: Имя пользователя Telegram

source: Ismi
ru: Имя

source: Familiyasi
ru: Фамилия

source: Otasining ismi
ru: Отчество

source: Telefon raqami
ru: Номер телефона

source: Til
ru: Язык

source: Fakultet (OTM)
ru: Факультет (ВУЗ)

source: staff status
ru: статус сотрудника

source: Designates whether the user can log into this admin site.
ru: Определяет, может ли пользователь войти на этот сайт администрирования.

source: active
ru: активен

source: Designates whether this user should be treated as active. Unselect this instead of deleting accounts.
ru: Определяет, следует ли считать этого пользователя активным. Снимите этот флажок вместо удаления учетных записей.

source: Yaratilgan sana
ru: Дата создания

source: Yangilangan sana
ru: Дата обновления

source: Foydalanuvchi
ru: Пользователь

source: Foydalanuvchilar
ru: Пользователи

source: Minimal kurs/bosqich
ru: Минимальный курс/ступень

source: Maksimal kurs/bosqich
ru: Максимальный курс/ступень

source: Voucher rasmi uchun shablon nomi (masalan, Matematika -> VoucherMatematika). Agar bo'sh bo'lsa, standart ishlatiladi.
ru: Имя шаблона для изображения ваучера (например, Математика -> VoucherMatematika). Если пусто, используется стандартный.

source: Voucher shabloni nomi
ru: Имя шаблона ваучера

source: Aktiv
ru: Активен

source: Fanlar
ru: Предметы

source: Savol fayli (O'zbekcha, DOCX)
ru: Файл с вопросами (Узбекский, DOCX)

source: Savol fayli (Qoraqalpoqcha, DOCX)
ru: Файл с вопросами (Каракалпакский, DOCX)

source: Savol fayli (Ruscha, DOCX)
ru: Файл с вопросами (Русский, DOCX)

source: To'g'ri javob
ru: Правильный ответ

source: Fayl yuklanmagan
ru: Файл не загружен

source: Savol
ru: Вопрос

source: Hech bo'lmaganda bitta tilda savol faylini yuklang.
ru: Загрузите файл с вопросами хотя бы на одном языке.

source: Savollar
ru: Вопросы

source: Boshlangan vaqti
ru: Время начала

source: Tugatilgan vaqti
ru: Время окончания

source: Natija (ball)
ru: Результат (балл)

source: Berilgan savollar
ru: Заданные вопросы

source: Sarflangan vaqt (sekund)
ru: Затраченное время (секунд)

source: Voucher yuborildimi?
ru: Ваучер отправлен?

source: Voucher kodi/raqami
ru: Код/номер ваучера

source: Test
ru: Тест

source: Testlar
ru: Тесты

source: Home
ru: Главная

source: Yuklash
ru: Загрузить

source: Xatolik
ru: Ошибка

source: Xatolik!
ru: Ошибка!

source: Kechirasiz, kutilmagan xatolik yuz berdi.
ru: Извините, произошла непредвиденная ошибка.

source: Iltimos, keyinroq qayta urinib ko'ring yoki bot orqali administratorga murojaat qiling.
ru: Пожалуйста, попробуйте позже или свяжитесь с администратором через бота.

source: Yopish
ru: Закрыть

source: Testga Tayyorgarlik
ru: Подготовка к тесту

source: Assalomu alaykum, %(user_name)s!
ru: Здравствуйте, %(user_name)s!

source: Test jami <strong>%(count)s</strong> savoldan iborat.
ru: В тесте всего <strong>%(count)s</strong> вопрос.

source: Test uchun ajratilgan vaqt
ru: Время, отведенное на тест

source: daqiqa
ru: минут

source: Orqaga
ru: Назад

source: Testni Boshlash
ru: Начать тест

source: Omad tilaymiz!
ru: Желаем удачи!

source: Ko'p Savol Yuklash
ru: Массовая загрузка вопросов

source: Ro'yxatdan o'tish
ru: Регистрация

source: Qo'shimcha ma'lumotlarni kiriting
ru: Введите дополнительную информацию

source: Saqlash va Davom Etish
ru: Сохранить и продолжить

source: Maʼlumot yuklashda xatolik
ru: Ошибка при загрузке данных

source: Server bilan bogʻlanishda xatolik
ru: Ошибка соединения с сервером

source: Yuklanmoqda...
ru: Загрузка...

source: Avval taʼlim turini tanlang
ru: Сначала выберите тип образования

source: Avval muassasa turini tanlang
ru: Сначала выберите тип учебного заведения

source: Avval muassasani tanlang
ru: Сначала выберите учебное заведение

source: Telegram foydalanuvchi ID si topilmadi. Iltimos, bot orqali qayta kiring.
ru: ID пользователя Telegram не найден. Пожалуйста, войдите снова через бота.

source: Muvaffaqiyatli
ru: Успешно

source: Tabriklaymiz!
ru: Поздравляем!

source: Ma'lumotlaringiz muvaffaqiyatli saqlandi.
ru: Ваши данные успешно сохранены.

source: Endi WebApp oynasini yopishingiz mumkin.
ru: Теперь вы можете закрыть окно WebApp.

source: Yopish va Botga Qaytish
ru: Закрыть и вернуться в бот

source: Test Topshirilgan
ru: Тест пройден

source: Ma'lumot!
ru: Информация!

source: Siz allaqachon test topshirgansiz.
ru: Вы уже прошли тест.

source: Test Jarayonida
ru: Тест в процессе

source: Savol %(current)s/%(total)s
ru: Вопрос %(current)s/%(total)s

source: Oldingi
ru: Предыдущий

source: Keyingi
ru: Следующий

source: Testni Yakunlash
ru: Завершить тест

source: Xatolik yuz berdi:
ru: Произошла ошибка:

source: Nomaʼlum xato.
ru: Неизвестная ошибка.

source: Server bilan bogʻlanishda xatolik.
ru: Ошибка соединения с сервером.

source: Testni yakunlashda xatolik yuz berdi.
ru: Произошла ошибка при завершении теста.

source: Vaqt tugadi! Test avtomatik yakunlanadi.
ru: Время вышло! Тест будет завершен автоматически.

source: Test Natijalari
ru: Результаты теста

source: Sizning Test Natijangiz
ru: Ваш результат теста

source: Sarflangan vaqt
ru: Затраченное время

source: sekund
ru: секунд

source: Batafsil Natijalarni Ko'rish
ru: Посмотреть подробные результаты

source: Javoblaringiz:
ru: Ваши ответы:

source: savol
ru: вопрос

source: Sizning javobingiz
ru: Ваш ответ

source: Javob berilmagan
ru: Ответ не дан

source: Batafsil natijalar mavjud emas.
ru: Подробные результаты отсутствуют.

source: Fayl yuklanmagan.
ru: Файл не загружен.

source: Javoblar ketma-tetligi kiritilmagan.
ru: Последовательность ответов не введена.

source: DOCX fayl yaroqsiz (document.xml topilmadi).
ru: Файл DOCX недействителен (document.xml не найден).

source: DOCX faylidan savollar ajratib olinmadi (ehtimol delimiter "{}" topilmadi yoki fayl formati noto'g'ri), lekin javoblar mavjud.
ru: Вопросы из файла DOCX не извлечены (возможно, разделитель "{}" не найден или формат файла неверный), но ответы присутствуют.

source: DOCX fayli bo'sh yoki savol topilmadi va javoblar ham kiritilmagan.
ru: Файл DOCX пуст или вопрос не найден, и ответы также не введены.

source: Ajratilgan savollar soni ({}) kiritilgan javoblar soniga ({}) mos kelmadi.
ru: Количество извлеченных вопросов ({}) не соответствует количеству введенных ответов ({}).

source: DOCX fayl yaroqsiz zip arxiv (asosiy fayl).
ru: Файл DOCX является недействительным zip-архивом (основной файл).

source: DOCX fayl yaroqsiz XML tuzilishiga ega: {}
ru: Файл DOCX имеет недействительную структуру XML: {}

source: DOCX faylini qayta ishlashda kutilmagan xato: {}
ru: Непредвиденная ошибка при обработке файла DOCX: {}

source: Telegram ID topilmadi. Iltimos, bot orqali qayta urinib ko'ring.
ru: ID Telegram не найден. Пожалуйста, попробуйте снова через бота.

source: Foydalanuvchi topilmadi. Iltimos, botda /start buyrug'ini bering.
ru: Пользователь не найден. Пожалуйста, дайте команду /start в боте.

source: Telegram ID topilmadi. Xatolik.
ru: ID Telegram не найден. Ошибка.

source: Foydalanuvchi topilmadi. Qayta urinib ko'ring.
ru: Пользователь не найден. Попробуйте снова.

source: Ma'lumotlaringiz muvaffaqiyatli saqlandi!
ru: Ваши данные успешно сохранены!

source: Formani to'ldirishda xatoliklar mavjud. Iltimos, tekshirib qayta urinib ko'ring.
ru: При заполнении формы возникли ошибки. Пожалуйста, проверьте и попробуйте снова.

source: Xatolik yuz berdi.
ru: Произошла ошибка.

source: Muvaffaqiyatli ro'yxatdan o'tdingiz!
ru: Вы успешно зарегистрировались!

source: Test uchun savollar mavjud emas.
ru: Вопросы для теста отсутствуют.

source: Test uchun savollar topilmadi.
ru: Вопросы для теста не найдены.

source: Aktiv test topilmadi. Iltimos, testni qayta boshlang.
ru: Активный тест не найден. Пожалуйста, начните тест заново.

source: Test topilmadi.
ru: Тест не найден.

source: Testda savollar topilmadi.
ru: В тесте не найдены вопросы.

source: Savol matni topilmadi.
ru: Текст вопроса не найден.

source: Barcha savollarga javob berildi. Testni yakunlang.
ru: На все вопросы даны ответы. Завершите тест.

source: Test hali yakunlanmagan yoki allaqachon qayta ishlangan.
ru: Тест еще не завершен или уже обработан.

source: Test ID si topilmadi. Natijalarni ko'rsatib bo'lmaydi.
ru: ID теста не найден. Невозможно показать результаты.

source: Bu telefon raqami allaqachon mavjud.
ru: Этот номер телефона уже существует.

source: sizning test natijangiz
ru: ваш результат теста

source: Ishtirokingiz uchun rahmat!
ru: Спасибо за участие!

source: Toʻliq maʻlumot uchun telefon
ru: Телефон для полной информации

source: Foiz ko'rsatkichi
ru: В процентах

source: Natija 80 foizdan kam bo'lsa sertifikat berilmaydi! Sizda testni qayta yechib ko'rish imkoniyati bor.
ru: Если результат меньше 80 процентов, сертификат не выдаётся! У вас есть возможность пройти тест ещё раз.

source: Telegram ID majburiy.
ru: ID Telegram обязателен.

source: Foydalanuvchi allaqachon mavjud.
ru: Пользователь уже существует.

source: Foydalanuvchi muvaffaqiyatli ro'yxatdan o'tkazildi.
ru: Пользователь успешно зарегистрирован.

source: Faqat til yoki telefon raqamini yangilash mumkin.
ru: Можно обновить только язык или номер телефона.

source: Til muvaffaqiyatli yangilandi.
ru: Язык успешно обновлен.

source: Telefon raqami muvaffaqiyatli yangilandi.
ru: Номер телефона успешно обновлен.
