Repository: aybekjumashev/test_bot_for_students
Catalog: locale/kaa/LC_MESSAGES/django.po
Languages: kaa

source: Uzbek
kaa: Ózbek

source: Karakalpak
kaa: Qaraqalpaq

source: Russian
kaa: Rus

source: Shaxsiy maʻlumotlar
kaa: Jeke maǵlıwmatlar

source: Taʻlim maʻlumotlari
kaa: Bilimlendiriw maǵlıwmatları

source: Vaqt belgilari
kaa: Waqıt belgileri

source: Nomi
kaa: Atı

source: Fayl yo'q
kaa: Fayl joq

source: Mavjud Tillar
kaa: Bar Tiller

source: Turli tillardagi fayllarda savollar soni mos kelmadi: {}
kaa: Hár qıylı tildegi fayllarda sorawlar sanı sáykes kelmedi: {}

source: Savollarni ommaviy yuklash xatosi
kaa: Sorawlardı kópşilik júklew qátesi

source: Yuklash uchun savollar topilmadi (fayllar bo'sh yoki ajratilmadi).
kaa: Júklew ushın sorawlar tabılmadı (fayllar bos yaki ajıratılmadı).

source: {}-savol uchun javob topilmadi.
kaa: {}-soraw ushın juwap tabılmadı.

source: {} ta savol muvaffaqiyatli yuklandi.
kaa: {} soraw tabıslı júklendi.

source: Savollarni Ommaviy Yuklash
kaa: Sorawlardı Kópşilik Júklew

source: Test Savoli
kaa: Test Sorawı

source: Test Savollari
kaa: Test Sorawları

source: Aralash Test
kaa: Aralas Test

source: Test Tavsifi
kaa: Test Sıpatlaması

source: va yana
kaa: hám jáne

source: ta savol...
kaa: soraw...

source: Tanlangan testlarni Excelga eksport qilish
kaa: Saylanǵan testlerdi Excelge eksport etiw

source: Eksport uchun testlar tanlanmadi.
kaa: Eksport ushın testler saylanbadı.

source: Yaq
kaa: Joq

source: Eksport uchun ma'lumot topilmadi.
kaa: Eksport ushın maǵlıwmat tabılmadı.

source: Test_Natijalari
kaa: Test_Nátiyjeleri

source: Ismingiz
kaa: Atıńız

source: Familiyangiz
kaa: Familiyańız

source: Otangizning ismi
kaa: Ákeńizdiń atı

source: Masalan: 1
kaa: Mısalı: 1

source: Ta'lim muassasasi turi
kaa: Bilimlendiriw mákemesiniń túri

source: Muassasa nomi
kaa: Mákeme atı

source: Ta'lim bosqichi (OTM uchun)
kaa: Bilimlendiriw basqıshı (JOO ushın)

source: Fakultet (OTM uchun)
kaa: Fakultet (JOO ushın)

source: Kurs (bosqich)
kaa: Kurs (basqısh)

source: Nechanchi kursda (yoki litsey/kollejda nechanchi bosqichda) o'qishingizni kiriting.
kaa: Neshenshi kursta (yamasa licey/kolledjde neshenshi basqıshta) oqıytuǵınıńızdı kiritiń.

source: Tanlang...
kaa: Saylań...

source: Avval ta'lim turini tanlang
kaa: Dáslep bilimlendiriw túrin saylań

source: OTM tanlanganda ochiladi
kaa: JOO saylanǵanda ashıladı

source: OTM uchun ta'lim bosqichini tanlang.
kaa: JOO ushın bilimlendiriw basqıshın saylań.

source: OTM uchun fakultetni tanlang.
kaa: JOO ushın fakultetti saylań.

source: Fan
kaa: Pán

source: Fanni tanlang
kaa: Pándi saylań

source: Savollar fayli (O'zbekcha, DOCX)
kaa: Sorawlar faylı (Ózbekshe, DOCX)

source: Savollar fayli (Qoraqalpoqcha, DOCX)
kaa: Sorawlar faylı (Qaraqalpaqsha, DOCX)

source: Savollar fayli (Ruscha, DOCX)
kaa: Sorawlar faylı (Russha, DOCX)

source: Javoblar ketma-ketligi
kaa: Juwaplar izbe-izligi

source: Masalan: ABADDCB... Har bir fayldagi savollar soniga mos kelishi kerak.
kaa: Mısalı: ABADDCB... Hár bir fayldaǵı sorawlar sanına sáykes keliwi kerek.

source: Savol ajratuvchi belgi
kaa: Soraw ajıratıwshı belgi

source: DOCX faylida savollarni ajratib turuvchi belgi.
kaa: DOCX faylında sorawlardı ajıratıp turıwshı belgi.

source: Javoblar faqat A, B, C, D harflaridan iborat bo'lishi kerak.
kaa: Juwaplar tek A, B, C, D háriplerinen ibarat bolıwı kerek.

source: Hech bo'lmaganda bitta tilda savollar faylini yuklang.
kaa: Keminde bir tilde sorawlar faylın júkleń.

source: Javoblar ketma-ketligini kiriting.
kaa: Juwaplar izbe-izligin kiritiń.

source: Nomi (O'zbekcha)
kaa: Atı (Ózbekshe)

source: Nomi (Qoraqalpoqcha)
kaa: Atı (Qaraqalpaqsha)

source: Nomi (Ruscha)
kaa: Atı (Russha)

source: Bu OTMmi?
kaa: Bul JOO ma?

source: Ta'lim muassasasi turlari
kaa: Bilimlendiriw mákemeleriniń túrleri

source: Ta'lim turi
kaa: Bilimlendiriw túri

source: Ta'lim muassasasi
kaa: Bilimlendiriw mákemesi

source: Ta'lim muassasalari
kaa: Bilimlendiriw mákemeleri

source: Ta'lim bosqichi (OTM)
kaa: Bilimlendiriw basqıshı (JOO)

source: Ta'lim bosqichlari (OTM)
kaa: Bilimlendiriw basqıshları (JOO)

source: Fakultetlar
kaa: Fakultetler

source: The Telegram ID must be set
kaa: Telegram ID belgilenген bolıwı kerek

source: Superuser must have is_staff=True.
kaa: Superpaydalanıwshıda is_staff=True bolıwı kerek.

source: Superuser must have is_superuser=True.
kaa: Superpaydalanıwshıda is_superuser=True bolıwı kerek.

source: Superusers must have a password.
kaa: Superpaydalanıwshılarda qupıya sóz bolıwı kerek.

source: Telegram Username
kaa: Telegram Paydalanıwshı Atı

source: Ismi
kaa: Atı

source: Familiyasi
kaa: Familiyası

source: Otasining ismi
kaa: Ákesiniń atı

source: Telefon raqami
kaa: Telefon nomeri

source: Fakultet (OTM)
kaa: Fakultet (JOO)

source: staff status
kaa: xızmetker statusı

source: Designates whether the user can log into this admin site.
kaa: Paydalanıwshınıń usı administrator saytına kire alatuǵınlıǵın belgileydi.

source: active
kaa: aktiv

source: Designates whether this user should be treated as active. Unselect this instead of deleting accounts.
kaa: Bul paydalanıwshınıń aktiv dep esaplanıwın belgileydi. Akkauntlardı óshiriw ornına bunı biykarlań.

source: Yaratilgan sana
kaa: Dóretilgen sáne

source: Yangilangan sana
kaa: Jańalanǵan sáne

source: Foydalanuvchi
kaa: Paydalanıwshı

source: Foydalanuvchilar
kaa: Paydalanıwshılar

source: Minimal kurs/bosqich
kaa: Minimal kurs/basqısh

source: Maksimal kurs/bosqich
kaa: Maksimal kurs/basqısh

source: Voucher rasmi uchun shablon nomi (masalan, Matematika -> VoucherMatematika). Agar bo'sh bo'lsa, standart ishlatiladi.
kaa: Vaucher súwreti ushın shablon atı (mısalı, Matematika -> VaucherMatematika). Eger bos bolsa, standart qollanıladı.

source: Voucher shabloni nomi
kaa: Vaucher shablonınıń atı

source: Fanlar
kaa: Pánler

source: Savol fayli (O'zbekcha, DOCX)
kaa: Soraw faylı (Ózbekshe, DOCX)

source: Savol fayli (Qoraqalpoqcha, DOCX)
kaa: Soraw faylı (Qaraqalpaqsha, DOCX)

source: Savol fayli (Ruscha, DOCX)
kaa: Soraw faylı (Russha, DOCX)

source: To'g'ri javob
kaa: Durıs juwap

source: Fayl yuklanmagan
kaa: Fayl júklenbegen

source: Savol
kaa: Soraw

source: Hech bo'lmaganda bitta tilda savol faylini yuklang.
kaa: Keminde bir tilde soraw faylın júkleń.

source: Savollar
kaa: Sorawlar

source: Boshlangan vaqti
kaa: Baslanǵan waqtı

source: Tugatilgan vaqti
kaa: Pitkerilgen waqtı

source: Natija (ball)
kaa: Nátiyje (ball)

source: Berilgan savollar
kaa: Berilgen sorawlar

source: Sarflangan vaqt (sekund)
kaa: Sarplanǵan waqıt (sekund)

source: Voucher yuborildimi?
kaa: Vaucher jiberildi me?

source: Voucher kodi/raqami
kaa: Vaucher kodı/nomeri

source: Testlar
kaa: Testler

source: Home
kaa: Bas bet

source: Yuklash
kaa: Júklew

source: Xatolik
kaa: Qátelik

source: Xatolik!
kaa: Qátelik!

source: Kechirasiz, kutilmagan xatolik yuz berdi.
kaa: Keshiriń, kútilmegen qátelik júz berdi.

source: Iltimos, keyinroq qayta urinib ko'ring yoki bot orqali administratorga murojaat qiling.
kaa: Iltimas, keyinirek qayta urınıp kóriń yaki bot arqalı administratorǵa múrájat etiń.

source: Yopish
kaa: Jabıw

source: Testga Tayyorgarlik
kaa: Testke Tayarlıq

source: Assalomu alaykum, %(user_name)s!
kaa: Assalawma áleykum, %(user_name)s!

source: Test jami <strong>%(count)s</strong> savoldan iborat.
kaa: Test jámi <strong>%(count)s</strong> sorawdan ibarat.

source: Test uchun ajratilgan vaqt
kaa: Test ushın ajıratılǵan waqıt

source: daqiqa
kaa: minut

source: Orqaga
kaa: Artqa

source: Testni Boshlash
kaa: Testti Baslaw

source: Omad tilaymiz!
kaa: Áwmet tileymiz!

source: Ko'p Savol Yuklash
kaa: Kóp Soraw Júklew

source: Ro'yxatdan o'tish
kaa: Dizimnen ótiw

source: Qo'shimcha ma'lumotlarni kiriting
kaa: Qosımsha maǵlıwmatlardı kiritiń

source: Saqlash va Davom Etish
kaa: Saqlaw hám Dawam Etiw

source: Maʼlumot yuklashda xatolik
kaa: Maǵlıwmat júklewde qátelik

source: Server bilan bogʻlanishda xatolik
kaa: Server menen baylanısıwda qátelik

source: Yuklanmoqda...
kaa: Júklenbekte...

source: Avval taʼlim turini tanlang
kaa: Dáslep bilimlendiriw túrin saylań

source: Avval muassasa turini tanlang
kaa: Dáslep mákeme túrin saylań

source: Avval muassasani tanlang
kaa: Dáslep mákemeni saylań

source: Telegram foydalanuvchi ID si topilmadi. Iltimos, bot orqali qayta kiring.
kaa: Telegram paydalanıwshı ID si tabılmadı. Iltimas, bot arqalı qayta kiriń.

source: Muvaffaqiyatli
kaa: Tabıslı

source: Tabriklaymiz!
kaa: Qutlıqlaymız!

source: Ma'lumotlaringiz muvaffaqiyatli saqlandi.
kaa: Maǵlıwmatlarıńız tabıslı saqlandı.

source: Endi WebApp oynasini yopishingiz mumkin.
kaa: Endi WebApp áynekishesin jabıwıńız múmkin.

source: Yopish va Botga Qaytish
kaa: Jabıw hám Botqa Qaytıw

source: Test Topshirilgan
kaa: Test Tapsırılǵan

source: Ma'lumot!
kaa: Maǵlıwmat!

source: Siz allaqachon test topshirgansiz.
kaa: Siz álleqashan test tapsırǵansız.

source: Test Jarayonida
kaa: Test Barısında

source: Savol %(current)s/%(total)s
kaa: Soraw %(current)s/%(total)s

source: Oldingi
kaa: Aldıńǵı

source: Testni Yakunlash
kaa: Testti Juwmaqlaw

source: Xatolik yuz berdi:
kaa: Qátelik júz berdi:

source: Nomaʼlum xato.
kaa: Námálim qáte.

source: Server bilan bogʻlanishda xatolik.
kaa: Server menen baylanısıwda qátelik.

source: Testni yakunlashda xatolik yuz berdi.
kaa: Testti juwmaqlawda qátelik júz berdi.

source: Vaqt tugadi! Test avtomatik yakunlanadi.
kaa: Waqıt tawsıldı! Test avtomat túrde juwmaqlanadı.

source: Test Natijalari
kaa: Test Nátiyjeleri

source: Sizning Test Natijangiz
kaa: Siziń Test Nátiyjeńiz

source: Sarflangan vaqt
kaa: Sarplanǵan waqıt

source: Batafsil Natijalarni Ko'rish
kaa: Tolıq Nátiyjelerdi Kóriw

source: Javoblaringiz:
kaa: Juwaplarıńız:

source: savol
kaa: soraw

source: Sizning javobingiz
kaa: Siziń juwabıńız

source: Javob berilmagan
kaa: Juwap berilmegen

source: Batafsil natijalar mavjud emas.
kaa: Tolıq nátiyjeler joq.

source: Fayl yuklanmagan.
kaa: Fayl júklenbegen.

source: Javoblar ketma-tetligi kiritilmagan.
kaa: Juwaplar izbe-izligi kiritilmegen.

source: DOCX fayl yaroqsiz (document.xml topilmadi).
kaa: DOCX faylı jaramsız (document.xml tabılmadı).

source: DOCX faylidan savollar ajratib olinmadi (ehtimol delimiter "{}" topilmadi yoki fayl formati noto'g'ri), lekin javoblar mavjud.
kaa: DOCX faylınan sorawlar ajıratıp alınbadı (itimal ajıratıwshı "{}" tabılmadı yaki fayl formatı nadurıs), biraq juwaplar bar.

source: DOCX fayli bo'sh yoki savol topilmadi va javoblar ham kiritilmagan.
kaa: DOCX faylı bos yaki soraw tabılmadı hám juwaplar da kiritilmegen.

source: Ajratilgan savollar soni ({}) kiritilgan javoblar soniga ({}) mos kelmadi.
kaa: Ajıratılǵan sorawlar sanı ({}) kiritilgen juwaplar sanına ({}) sáykes kelmedi.

source: DOCX fayl yaroqsiz zip arxiv (asosiy fayl).
kaa: DOCX faylı jaramsız zip arxiv (tiykarǵı fayl).

source: DOCX fayl yaroqsiz XML tuzilishiga ega: {}
kaa: DOCX faylı jaramsız XML dúzilisine iye: {}

source: DOCX faylini qayta ishlashda kutilmagan xato: {}
kaa: DOCX faylın qayta islewde kútilmegen qáte: {}

source: Telegram ID topilmadi. Iltimos, bot orqali qayta urinib ko'ring.
kaa: Telegram ID tabılmadı. Iltimas, bot arqalı qayta urınıp kóriń.

source: Foydalanuvchi topilmadi. Iltimos, botda /start buyrug'ini bering.
kaa: Paydalanıwshı tabılmadı. Iltimas, botta /start buyrıǵın beriń.

source: Telegram ID topilmadi. Xatolik.
kaa: Telegram ID tabılmadı. Qátelik.

source: Foydalanuvchi topilmadi. Qayta urinib ko'ring.
kaa: Paydalanıwshı tabılmadı. Qayta urınıp kóriń.

source: Ma'lumotlaringiz muvaffaqiyatli saqlandi!
kaa: Maǵlıwmatlarıńız tabıslı saqlandı!

source: Formani to'ldirishda xatoliklar mavjud. Iltimos, tekshirib qayta urinib ko'ring.
kaa: Formanı toltırıwda qátelikler bar. Iltimas, tekserip qayta urınıp kóriń.

source: Xatolik yuz berdi.
kaa: Qátelik júz berdi.

source: Muvaffaqiyatli ro'yxatdan o'tdingiz!
kaa: Tabıslı dizimnen óttińiz!

source: Test uchun savollar mavjud emas.
kaa: Test ushın sorawlar joq.

source: Test uchun savollar topilmadi.
kaa: Test ushın sorawlar tabılmadı.

source: Aktiv test topilmadi. Iltimos, testni qayta boshlang.
kaa: Aktiv test tabılmadı. Iltimas, testti qayta baslań.

source: Test topilmadi.
kaa: Test tabılmadı.

source: Testda savollar topilmadi.
kaa: Testte sorawlar tabılmadı.

source: Savol matni topilmadi.
kaa: Soraw tekstı tabılmadı.

source: Barcha savollarga javob berildi. Testni yakunlang.
kaa: Barlıq sorawlarǵa juwap berildi. Testti juwmaqlan.

source: Test hali yakunlanmagan yoki allaqachon qayta ishlangan.
kaa: Test házirshe juwmaqlanbaǵan yaki álleqashan qayta islengen.

source: Test ID si topilmadi. Natijalarni ko'rsatib bo'lmaydi.
kaa: Test ID si tabılmadı. Nátiyjelerdi kórsetip bolmaydı.

source: Bu telefon raqami allaqachon mavjud.
kaa: Bul telefon nomeri álleqashan bar.

source: sizning test natijangiz
kaa: siziń test nátiyjeńiz

source: Ishtirokingiz uchun rahmat!
kaa: Qatnasıwıńız ushın raxmet!

source: Toʻliq maʻlumot uchun telefon
kaa: Tolıq maǵlıwmat ushın telefon

source: Foiz ko'rsatkichi
kaa: Procent kórsetkishi

source: Natija 80 foizdan kam bo'lsa sertifikat berilmaydi! Sizda testni qayta yechib ko'rish imkoniyati bor.
kaa: Nátiyje 80 procentten kem bolsa sertifikat berilmeydi! Sizde testti qayta sheship kóriw imkaniyatı bar.

source: Telegram ID majburiy.
kaa: Telegram ID májburiy.

source: Foydalanuvchi allaqachon mavjud.
kaa: Paydalanıwshı álleqashan bar.

source: Foydalanuvchi muvaffaqiyatli ro'yxatdan o'tkazildi.
kaa: Paydalanıwshı tabıslı dizimnen ótkizildi.

source: Faqat til yoki telefon raqamini yangilash mumkin.
kaa: Tek ǵana til yaki telefon nomerin jańalaw múmkin.

source: Til muvaffaqiyatli yangilandi.
kaa: Til tabıslı jańalandı.

source: Telefon raqami muvaffaqiyatli yangilandi.
kaa: Telefon nomeri tabıslı jańalandı.
